[
  { "category": "Aluminium Alloys", "name": "Aluminium 2014", "alpha": 23.0, "desc": "High-strength Al-Cu alloy; good for machined parts and aerospace-style plate. Not the best for corrosion resistance." },
  { "category": "Aluminium Alloys", "name": "Aluminium 2024", "alpha": 22.8, "desc": "High-strength aerospace Al-Cu alloy; great for structural parts. Lower corrosion resistance than 6xxx series." },
  { "category": "Aluminium Alloys", "name": "Aluminium 6061", "alpha": 23.4, "desc": "General-purpose aluminium for CNC and fabrication; widely available, weldable, and reliable." },
  { "category": "Aluminium Alloys", "name": "Aluminium 6082", "alpha": 23.4, "desc": "Common EU structural aluminium; a go-to for general machining and fabrication with good strength." },
  { "category": "Aluminium Alloys", "name": "Aluminium 7075", "alpha": 23.2, "desc": "Very high-strength aluminium; great for highly loaded parts and tooling. Less weldable and can be notch-sensitive." },

  { "category": "Aluminium Alloys", "name": "Aluminium 1050", "alpha": 23.6, "desc": "Commercially pure aluminium; soft and very formable. Used for sheet work, covers, and general fabrication." },
  { "category": "Aluminium Alloys", "name": "Aluminium 5083", "alpha": 23.8, "desc": "Marine-grade aluminium; excellent corrosion resistance and weldability. Often used in plate." },
  { "category": "Aluminium Alloys", "name": "Aluminium 5754", "alpha": 23.7, "desc": "Fabrication-friendly aluminium; good corrosion resistance for sheet/plate parts and welded assemblies." },
  { "category": "Aluminium Alloys", "name": "Aluminium MIC-6 (Cast Tooling Plate)", "alpha": 23.6, "desc": "Cast, stress-relieved tooling plate; very flat and stable. Ideal for fixtures, plates, and machine components." },
  { "category": "Aluminium Alloys", "name": "Aluminium A356 (Cast)", "alpha": 21.0, "desc": "Common cast aluminium alloy; good castability and stability. Often used for housings and cast components." },

  { "category": "Aluminium Alloys", "name": "Aluminium 6063", "alpha": 23.5, "desc": "Extrusion alloy; common for profiles, rails, and light structural parts. Typically better finish than 6061." },
  { "category": "Aluminium Alloys", "name": "Aluminium 6081", "alpha": 23.4, "desc": "Less common designation; sometimes used in older specs/supply chains. Treat as 6082-family structural aluminium." },
  { "category": "Aluminium Alloys", "name": "Aluminium 7050", "alpha": 23.1, "desc": "Aerospace plate alloy; high strength with improved stress-corrosion resistance vs 7075." },

  { "category": "Copper Alloys (Brass & Bronze)", "name": "Copper ETP", "alpha": 16.8, "desc": "Electrolytic tough pitch copper; excellent electrical/thermal conductivity. Soft and can be gummy to machine." },
  { "category": "Copper Alloys (Brass & Bronze)", "name": "Copper OFHC", "alpha": 16.5, "desc": "Oxygen-free high-conductivity copper; used for vacuum/electrical/thermal parts. Very soft and can smear when cutting." },
  { "category": "Copper Alloys (Brass & Bronze)", "name": "Beryllium Copper", "alpha": 17.8, "desc": "High-strength copper alloy; great for springs, contacts, and tooling. Often heat-treated; dust control matters when machining." },

  { "category": "Copper Alloys (Brass & Bronze)", "name": "Brass CW505L", "alpha": 19.9, "desc": "Formable brass for sheet/presswork; good corrosion resistance and appearance. Not the best for heavy wear parts." },
  { "category": "Copper Alloys (Brass & Bronze)", "name": "Brass CW614N (Free Cutting)", "alpha": 20.5, "desc": "Free-machining brass; excellent for turned parts and threads. Not ideal for high-load sliding wear." },
  { "category": "Copper Alloys (Brass & Bronze)", "name": "Brass CZ121", "alpha": 20.5, "desc": "UK designation for free-cutting brass; used for turned components, fittings, and fasteners." },

  { "category": "Copper Alloys (Brass & Bronze)", "name": "Phosphor Bronze", "alpha": 17.8, "desc": "Wear-resistant bronze; good fatigue life for springs and excellent sliding for bushes." },
  { "category": "Copper Alloys (Brass & Bronze)", "name": "Bronze SAE 660", "alpha": 18.0, "desc": "Classic bearing bronze; dependable for bushes, thrust washers, and wear parts with good embedability." },
  { "category": "Copper Alloys (Brass & Bronze)", "name": "Aluminium Bronze (C95400)", "alpha": 17.0, "desc": "High-strength bronze; good wear and corrosion resistance. Used in marine, heavy-duty bushes, and load parts." },

  { "category": "Nickel Alloys", "name": "Nickel 200", "alpha": 13.3, "desc": "Commercially pure nickel; strong chemical resistance and good electrical properties. Not a high-strength alloy." },
  { "category": "Nickel Alloys", "name": "Monel 400", "alpha": 14.0, "desc": "Nickel-copper alloy for marine/chemical service; corrosion resistant and tough. Can work-harden during machining." },
  { "category": "Nickel Alloys", "name": "Inconel 718", "alpha": 13.0, "desc": "Nickel superalloy for high temperature strength; aerospace/turbine-grade. Difficult machining; work-hardens." },

  { "category": "Titanium Alloys", "name": "Titanium 6Al-4V", "alpha": 8.6, "desc": "Grade 5 titanium; high strength-to-weight and low expansion. Tough to machine and prone to spring-back." },
  { "category": "Titanium Alloys", "name": "Titanium Grade 2 (CP)", "alpha": 8.7, "desc": "Commercially pure titanium; excellent corrosion resistance and good formability. Lower strength than Grade 5." },

  { "category": "Polymers", "name": "ABS", "alpha": 90.0, "desc": "General engineering plastic; easy to machine and tough. High expansion and can creep under load." },
  { "category": "Polymers", "name": "Acetal Copolymer (POM-C)", "alpha": 30.0, "desc": "Low-friction plastic; stable and machinable. Great for bushes, sliders, and general precision plastic parts." },
  { "category": "Polymers", "name": "Delrin (Acetal Homopolymer, POM-H)", "alpha": 26.1, "desc": "Stiffer acetal with excellent machinability; good for precise low-friction parts. Slightly different properties vs POM-C by supplier." },
  { "category": "Polymers", "name": "Delrin AF (PTFE-Filled)", "alpha": 27.8, "desc": "PTFE-filled acetal; lower friction and improved wear for sliding parts. Strength can be slightly reduced vs unfilled." },
  { "category": "Polymers", "name": "Nylon 6/6", "alpha": 90.0, "desc": "Tough and impact resistant; common for wear parts. Moisture absorption changes size and properties." },

  { "category": "Polymers", "name": "PEEK (Unfilled)", "alpha": 14.4, "desc": "High-performance polymer; heat resistant and strong. Good for precision parts where plastics must behave more like metals." },
  { "category": "Polymers", "name": "PEEK Bearing Grade", "alpha": 9.4, "desc": "Filled PEEK for wear; improved sliding performance with lower expansion than unfilled. Used for bushes and seals." },
  { "category": "Polymers", "name": "PEEK CF30 (30% Carbon-Filled)", "alpha": 5.6, "desc": "Carbon-filled PEEK; very low expansion and high stiffness. Excellent for precision polymer components." },
  { "category": "Polymers", "name": "PEEK GF30 (30% Glass-Filled)", "alpha": 6.7, "desc": "Glass-filled PEEK; low expansion and stiff. Can be more abrasive to mating surfaces than unfilled." },

  { "category": "Polymers", "name": "PTFE (Teflon)", "alpha": 143.0, "desc": "Extremely low friction and chemically resistant. Very high expansion and can cold-flow/creep under load." },
  { "category": "Polymers", "name": "HDPE", "alpha": 116.0, "desc": "Common, easy-fabrication plastic; tough and chemical resistant. High expansion and lower stiffness." },
  { "category": "Polymers", "name": "UHMW-PE", "alpha": 170.0, "desc": "Very tough wear plastic; excellent sliding/impact. Very high expansion and difficult to hold tight tolerances." },
  { "category": "Polymers", "name": "Polycarbonate (PC)", "alpha": 68.0, "desc": "Tough, impact resistant, often clear. Moderate-high expansion and can stress crack with some chemicals." },

  { "category": "Polymers", "name": "PVC (Rigid)", "alpha": 52.0, "desc": "Rigid PVC for panels, ducting, and fabricated parts. Moderate expansion; chemical resistant but lower temperature capability." },
  { "category": "Polymers", "name": "Polypropylene (PP)", "alpha": 100.0, "desc": "Light, chemical-resistant fabrication plastic. High expansion and relatively flexible." },
  { "category": "Polymers", "name": "PET", "alpha": 60.0, "desc": "Stable polyester plastic; good dimensional stability for a commodity polymer. Moderate expansion." },
  { "category": "Polymers", "name": "Phenolic (Bakelite)", "alpha": 20.0, "desc": "Laminated resin used for fixtures and electrical insulation; relatively stable for a polymer. Can be brittle." },

  { "category": "Ceramics & Glass", "name": "Soda-lime Glass", "alpha": 9.0, "desc": "Common glass for general use; moderate expansion and not great for thermal shock." },
  { "category": "Ceramics & Glass", "name": "Borosilicate Glass", "alpha": 3.3, "desc": "Low-expansion glass with good thermal shock resistance; labware and instrument parts." },
  { "category": "Ceramics & Glass", "name": "Fused Silica", "alpha": 0.5, "desc": "Ultra-low expansion glass; excellent for optics and metrology where stability matters most." },

  { "category": "Ceramics & Glass", "name": "Alumina (96%)", "alpha": 7.5, "desc": "Common technical ceramic; stiff and wear resistant. Used for fixtures, insulators, and wear components." },
  { "category": "Ceramics & Glass", "name": "Zirconia", "alpha": 10.5, "desc": "Very tough ceramic for a ceramic; used for wear parts, probes, and impact-prone applications." },
  { "category": "Ceramics & Glass", "name": "Silicon Carbide", "alpha": 4.0, "desc": "Very stiff, wear resistant ceramic; low expansion. Used for precision, wear, and high-stiffness parts." },

  { "category": "Carbides", "name": "Tungsten Carbide", "alpha": 4.9, "desc": "Cutting tool and wear material; very stiff with low expansion. Great for gauges, wear pads, and tooling." },
  { "category": "Carbides", "name": "Titanium Carbide (TiC)", "alpha": 7.4, "desc": "Hard carbide ceramic; used in cutting and wear applications. Higher expansion than tungsten carbide." },
  { "category": "Carbides", "name": "Boron Carbide (B4C)", "alpha": 5.6, "desc": "Extremely hard ceramic; wear and abrasive service. Often used where weight and hardness matter." },

  { "category": "Carbon & Graphite", "name": "Graphite — Polycrystalline (General/Average)", "alpha": 4.5, "desc": "Graphite average value when orientation is unknown; useful for general estimating and mixed-grain parts." },
  { "category": "Carbon & Graphite", "name": "Graphite — Parallel / In-plane", "alpha": 1.5, "desc": "Along basal planes; lowest expansion direction. Relevant for plates or layups with known orientation." },
  { "category": "Carbon & Graphite", "name": "Graphite — Perpendicular / Through-thickness", "alpha": 4.0, "desc": "Normal to basal planes; higher expansion direction. Relevant for thickness growth in graphite plates." },
  { "category": "Carbon & Graphite", "name": "Carbon Fibre Composite (Generic)", "alpha": 2.0, "desc": "Direction-averaged CFRP; expansion varies strongly by fibre orientation and layup. Use as a rough estimate." },

  { "category": "Cast Irons", "name": "Grey Cast Iron (EN-GJL-250)", "alpha": 10.8, "desc": "Machine bases and plates; excellent vibration damping and good thermal stability. Great for fixtures and machine parts." },
  { "category": "Cast Irons", "name": "Ductile Cast Iron (EN-GJS-500)", "alpha": 11.0, "desc": "Nodular iron; tougher than grey iron with similar expansion. Used for stronger cast components." },

  { "category": "Stainless Steels", "name": "Stainless 17-4 PH", "alpha": 11.0, "desc": "Precipitation-hardening stainless; high strength with moderate expansion (condition dependent). Used for shafts and high-strength parts." },
  { "category": "Stainless Steels", "name": "Stainless 303", "alpha": 17.3, "desc": "Free-machining austenitic stainless; great for turned parts. Reduced corrosion resistance vs 304/316." },
  { "category": "Stainless Steels", "name": "Stainless 304", "alpha": 17.3, "desc": "General-purpose austenitic stainless; widely used for fabricated and machined parts with good corrosion resistance." },
  { "category": "Stainless Steels", "name": "Stainless 316", "alpha": 16.0, "desc": "Marine/chemical austenitic stainless; better corrosion resistance than 304. Common for coastal/outdoor use." },
  { "category": "Stainless Steels", "name": "Stainless Duplex 2205", "alpha": 13.7, "desc": "Duplex stainless; high strength and strong chloride resistance. Often used in marine and process environments." },

  { "category": "Stainless Steels", "name": "Stainless 410", "alpha": 9.9, "desc": "Martensitic stainless; hardenable with lower expansion. Used for wear parts and moderate corrosion environments." },
  { "category": "Stainless Steels", "name": "Stainless 420", "alpha": 10.3, "desc": "Hardenable martensitic stainless; good for knives, tools, and wear parts. Better hardness potential than 410." },
  { "category": "Stainless Steels", "name": "Stainless 431", "alpha": 10.8, "desc": "High-strength martensitic stainless; used for shafts and high-load components. Expansion lower than austenitic grades." },
  { "category": "Stainless Steels", "name": "Stainless 904L", "alpha": 15.7, "desc": "Highly alloyed stainless for aggressive chemical environments; expensive but excellent corrosion resistance." },

  { "category": "Steels", "name": "Steel 1020", "alpha": 12.6, "desc": "Low carbon steel; general engineering and fabrication. Good baseline for mild steel expansion." },
  { "category": "Steels", "name": "Steel 1018", "alpha": 11.7, "desc": "Low carbon steel; common bar stock for machined parts. Good machinability and weldability." },
  { "category": "Steels", "name": "Steel EN1A / 12L14", "alpha": 11.5, "desc": "Free-machining mild steel; excellent for turned parts. Lower strength and weldability can be limited by leaded grades." },
  { "category": "Steels", "name": "Steel S235", "alpha": 12.0, "desc": "EU structural mild steel; common in frames and fabricated structures. Reliable general-purpose grade." },
  { "category": "Steels", "name": "Steel S355", "alpha": 12.0, "desc": "Higher strength EU structural steel; used for heavier-duty frames and structures with similar expansion to S235." },
  { "category": "Steels", "name": "Steel 4140 / EN8", "alpha": 12.3, "desc": "Medium alloy steel for shafts and gears; strong and heat-treatable. Very common engineering choice." },
  { "category": "Steels", "name": "Steel 4340 / EN24T", "alpha": 12.4, "desc": "High-strength alloy steel; used for highly loaded shafts/gears and aerospace-style parts. Tough and heat-treatable." },

  { "category": "Steels", "name": "Steel A2", "alpha": 11.0, "desc": "Air-hardening tool steel; stable in heat treatment. Good for dies, punches, and precision tooling." },
  { "category": "Steels", "name": "Steel D2", "alpha": 10.5, "desc": "High-wear tool steel; excellent abrasion resistance for dies and punches. Can be more brittle than A2." },
  { "category": "Steels", "name": "Steel P20", "alpha": 12.0, "desc": "Pre-hardened mould steel; used for plastic injection moulds and tooling plates. Machines well in pre-hard state." },
  { "category": "Steels", "name": "Invar 36", "alpha": 1.1, "desc": "Ultra-low expansion Fe-Ni alloy; used for metrology, fixtures, and precision references. Poor machinability and expensive." },
  { "category": "Steels", "name": "Tool Steel H13", "alpha": 11.5, "desc": "Hot-work tool steel; good toughness at temperature. Used for forging dies, hot tooling, and die-casting components." },

  { "category": "Steels", "name": "Steel EN3 / 070M20", "alpha": 12.0, "desc": "Mild/medium carbon steel; general engineering and fabrication. Common workshop material." },
  { "category": "Steels", "name": "Steel EN19 / 4140 QT", "alpha": 12.3, "desc": "Quenched & tempered alloy steel; strong and reliable for shafts/gears. A staple for high-load machined parts." },
  { "category": "Steels", "name": "Steel EN36A", "alpha": 11.5, "desc": "Case-hardening steel; used for gears and wear surfaces with a tough core. Useful where hard skin + tough inside is needed." },
  { "category": "Steels", "name": "Steel O1 Tool Steel", "alpha": 11.0, "desc": "Oil-hardening tool steel; good for cutters, punches, and general tooling. Simple heat treat and widely used." },

  { "category": "3D Printing Materials", "name": "PLA", "alpha": 68.0, "desc": "Common 3D printing plastic; stiff and easy to print. Can creep with heat and has moderate expansion." },
  { "category": "3D Printing Materials", "name": "PET-G", "alpha": 68.0, "desc": "Tough 3D printing plastic; good layer adhesion and lower warp. Moderate expansion." },
  { "category": "3D Printing Materials", "name": "ABS", "alpha": 90.0, "desc": "3D printing ABS; tough and heat resistant vs PLA, but warps more. High expansion and needs stable printing conditions." },
  { "category": "3D Printing Materials", "name": "ASA", "alpha": 80.0, "desc": "UV-stable ABS-like filament; good for outdoor parts. High expansion and can warp like ABS but often prints cleaner." },
  { "category": "3D Printing Materials", "name": "Nylon (3D Printing Grade)", "alpha": 90.0, "desc": "Tough, impact-resistant filament; good wear properties. Moisture sensitive and high expansion." },
  { "category": "3D Printing Materials", "name": "TPU", "alpha": 100.0, "desc": "Flexible filament; great for grips, bumpers, and dampers. High expansion and tolerance control is harder." },
  { "category": "3D Printing Materials", "name": "CF-Filled PLA / PET-G (Generic)", "alpha": 50.0, "desc": "Carbon-filled filament; stiffer with lower expansion than unfilled. Properties vary widely by brand and fill percentage." }
]
